benchmark/results/20260610_171330/read_committed_c100_j16.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload.sql
scaling factor: 1
query mode: simple
number of clients: 100
number of threads: 16
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 471891
number of failed transactions: 0 (0.000%)
latency average = 12.673 ms
initial connection time = 246.981 ms
tps = 7891.015292 (without initial connection time)