benchmark/results/20260610_171330/read_committed_c50_j8.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 8
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 475645
number of failed transactions: 0 (0.000%)
latency average = 6.296 ms
initial connection time = 125.070 ms
tps = 7941.829366 (without initial connection time)