benchmark/results/20260610_171330/serializable_c50_j4.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 4
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 312135
number of failed transactions: 0 (0.000%)
latency average = 9.587 ms
initial connection time = 178.649 ms
tps = 5215.248572 (without initial connection time)