benchmark/results/20260610_171330/serializable_c50_j8.txt
pgbench (18.3 (Homebrew), server 16.13 (Debian 16.13-1.pgdg13+1))
transaction type: /Users/ihyeonseo/Desktop/db_study/benchmark/join_workload_serializable.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 8
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 340491
number of failed transactions: 0 (0.000%)
latency average = 8.796 ms
initial connection time = 134.270 ms
tps = 5684.648724 (without initial connection time)